<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","label":"sandbox","backend":"bf064300631c588ef6582f66feefaf1b4df1a5f779d6700cdaeea59f87732e93","plan_job_ref":"Job .github/workflows/_test-tf.yaml #167 at https://github.com/DND-IT/github-workflows/actions/runs/21695939818","plan_out_hash":"3e5788ce008d58cd1d6b2afbd3a6fe21be8b6f19300da4031c96f3892ecc01a0","plan_hash":"4da54962ad3fcc063a549fb1152dcdd6a574e2852963549905a2f6ce96359894","plan_text_format":"diff","version":"2.2.2"} -->
Terraform plan for __sandbox__
<details>
<summary>Plan: 2 to add, 0 to change, 0 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # random_id.this will be created
+   resource "random_id" "this" {
+       b64_std     = (known after apply)
+       b64_url     = (known after apply)
+       byte_length = 4
+       dec         = (known after apply)
+       hex         = (known after apply)
+       id          = (known after apply)
    }

  # random_pet.this will be created
+   resource "random_pet" "this" {
+       id        = (known after apply)
+       length    = 2
+       separator = "-"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+   random_id  = (known after apply)
+   random_pet = (known after apply)
```
</details>

:memo: Plan generated in [.github/workflows/_test-tf.yaml #167](https://github.com/DND-IT/github-workflows/actions/runs/21695939818)